---
title: "InfluxDB"
tags: [database]
reference:
  - title:
    link:
---

* TOC 
{:toc}


# Install and run

<pre><code class="bash">
docker run --rm --name influxdb --net=host -d influxdb:1.6.6
</code></pre>


## Настройки

<pre><code class="bash">
root@avisPC:/# cat /etc/influxdb/influxdb.conf 
[meta]
  dir = "/var/lib/influxdb/meta"

[data]
  dir = "/var/lib/influxdb/data"
  engine = "tsm1"
  wal-dir = "/var/lib/influxdb/wal"
root@avisPC:/# 
</code></pre>

## Создание БД

<pre><code class="bash">
> create database mydb
> show databases
name: databases
name
----
_internal
mydb
> 
> use mydb
Using database mydb
</code></pre>

## Добавление данных `INSERT`

Формат
<pre><code class="bash">
measurementName field1=value1,field2=value2,field3=value3 timestamp
</code></pre>

* measurementName - название метки
* field1=value1 - key=value
* timestamp - время в наносекундах (10^9 пример - 1465839830100400200). Если не передан то используется серверное время

По умолчанию все числа типа double. Для integer добавляется i
<pre><code class="bash">
> insert measurementName field4=12i
> select * from measurementName
name: measurementName
time                field4
----                ------
1574592255930083990 12
</code></pre>

Строки должны быть в двойных кавычках
<pre><code class="bash">
> insert measurementName field5="qwqw"
> select * from measurementName
name: measurementName
time                field4 field5
----                ------ ------
1574592255930083990 12     
1574592333499942256        qwqw
> 
</code></pre>

Для булевых значений: Истина = t, T, true, TRUE. Лож = f, F, false, FALSE
<pre><code class="perl">
> insert data test=T
> select * from data
name: data
time                test
----                ----
1574592549079500904 true

</code></pre>

## Выборка `SELECT`

Все поля
<pre><code class="perl">
> select * from data;
name: data
time                test
----                ----
1574592549079500904 true
1574592622589779426 true
</code></pre>

Выборочные поля
<pre><code class="perl">
> select time, test from data;
name: data
time                test
----                ----
1574592549079500904 true
1574592622589779426 true
</code></pre>

Если содержиться ',', . или # то использоуются кавычки ""
<pre><code class="perl">
> select * from "app.log"
> select * from "\"app.log\""
name: "app.log"
time                "key1.name" field
----                ----------- -----
1574592847498859993 true        
1574592865627033880 true        
1574592895074671629             1
</code></pre>

## Удаление `DELETE`

Удаляет всю серию!
<pre><code class="perl">
> delete from test1
> select * from test1
> 
</code></pre>
<hr>

## Фильтры `WHERE`

Вывести все `измерения`
<pre><code class="perl">
> show MEASUREMENTs;
name: measurements
name
----
"app.log"
data
measurementName
> 
</code></pre>
